Revit 2027 API
GenericImportOptions.RefPoint Property
Reference point (in Revit) to which the image is going to be inserted.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public XYZ RefPoint { get; set; }
Public Property RefPoint As XYZ
	Get
	Set
public:
property XYZ^ RefPoint {
	XYZ^ get ();
	void set (XYZ^ value);
}
member RefPoint : XYZ with get, set
Property Value
XYZ
Remarks
If null, the image will be inserted to the Revit's origin.
See Also
Reference
GenericImportOptions Class
Autodesk.Revit.DB Namespace